In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
sozlukVerisi = {"istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumuDataFrame.dropna()
# NaN olan değerleri düşürür.
# fakat NaN olan satırı da silmiş olur.

   istanbul  Ankara  Izmır
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
havaDurumuDataFrame.dropna(axis = 1)
# NaN olmayan kolon hariç diğerlerini siler.

   Izmır
0     40
1     39
2     38

In [8]:
yeniVeri = {"istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis = 1, thresh = 2)
# kolonları baz alarak, 2 ve üstü NaN olan kolonları düşürür.

   istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDataFrame

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [12]:
yeniDataFrame.fillna(20)
# NaN değerleri yerine istediğin değeri girer.

   istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupby

In [19]:
maasSozlugu = {"Departman" : ["Yazilim", "Yazilim", "PAzarlama", "PAzarlama", "Hukuk", "Hukuk"],
              "Calisan Ismi" : ["Ahmet", "Mehmet", "Atil", "Burak", "Zeynep", "Fatma"],
              "Maas" : [100,150,200,300,400,500]
              }

In [20]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [21]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   150
2  PAzarlama         Atil   200
3  PAzarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [39]:
grupObjesi = maasDataFrame.groupby("Departman")
#Departman kolonuna göre gruplandır.

In [31]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
PAzarlama             2     2
Yazilim               2     2

In [35]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   400
PAzarlama         Atil   200
Yazilim          Ahmet   100

In [36]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   500
PAzarlama        Burak   300
Yazilim         Mehmet   150

In [37]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
PAzarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0